tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# GNU database manager
brew "gdbm"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Graphical system information display for macOS
brew "archey"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Test domains for typo squatting, phishing and corporate espionage
brew "dnstwist"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# International Ispell
brew "ispell"
# Synchronize a maildir with an IMAP server
brew "isync"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GNOME XML library
brew "libxml2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Compression program with a very high compression ratio
brew "lrzip"
# CLI client for interacting with LXD
brew "lxc"
# Securely transfers data between computers
brew "magic-wormhole"
# Make self-extractable archives on UNIX
brew "makeself"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Synchronizes emails between two repositories
brew "offlineimap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Steel Bank Common Lisp system
brew "sbcl"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compression/decompression library aiming for high speed
brew "snappy"
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# UNIX shell (command interpreter)
brew "zsh"
# Zstandard is a real-time compression algorithm
brew "zstd"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-dbus", "with-emacs-icons-project-EmacsIcon4", "with-mailutils", "with-no-frame-refocus"]
cask "alfred"
cask "alt-tab"
cask "arduino"
cask "chrysalis"
cask "disk-inventory-x"
cask "flux"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-ibm-plex"
cask "font-iosevka"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-ubuntu-mono-derivative-powerline"
cask "gimp"
cask "insomnia"
cask "iterm2"
cask "nvalt"
cask "qlcolorcode"
cask "qlmarkdown"
cask "spotify"
cask "suspicious-package"
cask "vagrant"
cask "vlc"
cask "wireshark"
cask "zenmap"
mas "BetterSnapTool", id: 417375580
mas "Xcode", id: 497799835
